[
  {
    "name": "Scrambled Eggs",
    "category": "breakfast",
    "ingredients": [
      "eggs",
      "milk",
      "salt",
      "pepper"
    ],
    "instructions": "1. Crack the eggs into a bowl.\n2. Add milk, salt, and pepper.\n3. Beat the mixture until combined.\n4. Heat a non-stick pan over medium heat.\n5. Pour the egg mixture into the pan.\n6. Stir gently until the eggs are cooked to your desired consistency."
  },
  {
    "name": "Chicken Alfredo Pasta",
    "category": "dinner",
    "ingredients": [
      "chicken breast",
      "fettuccine pasta",
      "heavy cream",
      "parmesan cheese",
      "garlic",
      "butter",
      "salt",
      "pepper"
    ],
    "instructions": "1. Cook the pasta according to package instructions.\n2. Season chicken breast with salt and pepper.\n3. In a skillet, melt butter over medium heat.\n4. Add minced garlic and cook until fragrant.\n5. Add chicken breast and cook until golden brown and cooked through.\n6. Remove chicken from skillet and set aside.\n7. In the same skillet, add heavy cream and bring to a simmer.\n8. Stir in parmesan cheese until melted and sauce is thickened.\n9. Slice cooked chicken breast and add to the sauce.\n10. Serve over cooked pasta."
  },
  {
    "name": "Avocado Toast",
    "category": "breakfast",
    "ingredients": [
      "2 ripes avocade",
      "4 slices of your favorite bread (whole wheat, sourdough, etc.)",
      "Salt and pepper to taste",
      "Red pepper flakes (optional)",
      "Lemon juice (optional)",
      "Olive oil (optional)",
      "Optional toppings: sliced tomatoes, microgreens, crumbled feta cheese, etc."
    ],
    "instructions": "Cut the avocados in half, remove the pit, and scoop out the flesh into a bowl.Mash the avocado with a fork until you achieve your desired consistency.Season with salt, pepper, and a splash of lemon juice to taste. You can also add a pinch of red pepper flakes for some heat.Toast the bread slices until golden brown and crispy.Spread the mashed avocado evenly onto each slice of toast."
  }
]